########(a) 計算A、M、S產出量#############
A <- matrix(              # 建立產出與消費矩陣
  c(0.2,0.2,0.1,
    0.2,0.4,0.1,
    0.1,0.2,0.3),
  nrow = 3, 
  byrow=TRUE,
  dimnames=list(         # 以list物件賦予列名、行名
    c('A','M','S'),
    c('A','M','S')
))
print(A)                 # 印出產出與消費
(I <- diag(3))           # 定義與上述A同為3x3的單位矩陣
(D <- matrix(            # 定義消費者的需求
  c(100,80,50),
  ncol = 1, 
  byrow=TRUE)) 
(X<-solve(I -A)%*% D)    # 代入公式，解A、M、S應有的產出值
########(b) 計算A、M、S的加值#############
X - D     # 為滿足消費者需求，內部生產過程的加值
############### end of 2_6.R #######################