(B<-cbind(c(-3,2),c(4,-2)))         # B 基底
(C<-cbind(c(-1,2),c(2,-2)))         # C 基底
(A<-rbind(c(-2,7),c(-3,7)))         # T對於B基底的轉換矩陣A 

(P<-solve(B)%*%C)         # C基底變換到B基底的轉移矩陣P
(iP<-solve(P))            # P的反矩陣(B 基底到C 基底的轉移矩陣)
(A2<-iP%*%A%*%P)          # T對於C基底的轉換矩陣A2(A的相似矩陣)

(v<-c(1,-4))              # v 在標準基底的座標向量
(vC<-solve(C)%*%v)        # v 在C基底的座標向量
(vB<-P%*%vC)              # v經轉移矩陣在B基底的座標向量
(TvB<-A%*%vB)             # v在B基底的座標向量經線性轉換的座標
(TvC<-solve(P)%*%TvB)     # v經過轉移矩陣及線性轉換矩陣在C基底的座標
all.equal(TvC,A2%*%vC)    # 印證圖3-47
##############end of 3._17.R###############

